# Pandas

In [ ]:
- pandas.pydata.org (to get description about padas)
- two types of data in pandas
- dataframe and series type
- dataframe can be declared in dictionary and table form

In [3]:
import pandas as pd
k=pd.Series([1,5,9,4])
print(k)

0    1
1    5
2    9
3    4
dtype: int64

In [4]:
m=pd.Series([45,63,98,65],index=["sonu","hello","hi","good"])
m

sonu     45
hello    63
hi       98
good     65
dtype: int64

In [6]:
m["sonu"]

45

In [8]:
m['good']

65

In [10]:
v=pd.DataFrame({"name":["bnb","abc"]})
v

  name
0  bnb
1  abc

In [11]:
v=pd.DataFrame({"name":["sonu","monu","tonu"],"Id":["755","756","757"],"Grade":["A","B","Fail"]})
v

   name   Id Grade
0  sonu  755     A
1  monu  756     B
2  tonu  757  Fail

In [16]:
m=pd.DataFrame([["das","asfhj","sdhj","shdii"],[1,2,3,7],[2,3,4,8]])
m

     0      1     2      3
0  das  asfhj  sdhj  shdii
1    1      2     3      7
2    2      3     4      8

In [18]:
# TASK 
### Create an array of 1's.Take a list & convert it into 3D array and add each element in an array
v=pd.Series([5,5])
v

0    5
1    5
dtype: int64